
open MyCalendar
open Interval

let google_calendar_id = "pg67c9dmfirgd4s20idfv57gis@group.calendar.google.com"
       
let monday = [
    (stmake "09:00" "09:45"), "математика, каб.314";
    (stmake "10:00" "10:45"), "русский язык, каб.206";
    (stmake "11:00" "11:45"), "франц/нем";
    (stmake "11:55" "12:40"), "чтение, каб.201";
    (stmake "13:00" "13:45"), "физкультура";
    (stmake "14:05" "14:50"), "история, каб.306";
  ]

let thursday = [
    (stmake "09:00" "09:45"), "математика, каб.313";
    (stmake "10:00" "10:45"), "математика, каб.313";
    (stmake "11:00" "11:45"), "русский язык, каб.206";
    (stmake "11:55" "12:40"), "обществознание, каб.209";
    (stmake "13:00" "13:45"), "литература, каб.206";
    (stmake "14:05" "14:50"), "английский язык";
  ]

let wednesday = [
    (stmake "09:00" "09:45"), "изо, каб.113";
    (stmake "10:00" "10:45"), "франц/нем";
    (stmake "11:00" "11:45"), "английский язык";
    (stmake "11:55" "12:40"), "русский язык, каб.206";
    (stmake "13:00" "13:45"), "биология, каб.102";
    (stmake "14:05" "14:50"), "литература, каб.206";
  ]
	       
let tuesday = [
    (stmake "09:00" "09:45"), "английский язык";
    (stmake "10:00" "10:45"), "физкультура";
    (stmake "11:00" "11:45"), "история, каб.206";
    (stmake "11:55" "12:40"), "математика, каб.212";
    (stmake "13:00" "13:45"), "математика, каб.208";
    (stmake "14:05" "14:50"), "география, каб.311";
  ]

let friday = [
    (stmake "09:00" "09:45"), "труд, каб.113";
    (stmake "10:00" "10:45"), "английский язык";
    (stmake "11:00" "11:45"), "русский язык, каб.206";
    (stmake "11:55" "12:40"), "русский язык, каб.206";
    (stmake "13:00" "13:45"), "ИКТ";
    (stmake "14:05" "14:50"), "классный час, каб.306";
  ]

let saturday = []

let sunday = []
